soa-java-soap/src/main/resources/samples/hotel-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://hotels.sources.com">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getHotelRequest>
         <gs:id>3</gs:id>
      </gs:getHotelRequest>
   </soapenv:Body>
</soapenv:Envelope>
